Revit 2027 API
ElectricalLoadClassification.DemandFactorId Property
 The demand factor definition this load classification element uses.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId DemandFactorId { get; set; }
Public Property DemandFactorId As ElementId
	Get
	Set
public:
property ElementId^ DemandFactorId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member DemandFactorId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The element id elemId is not a valid ElectricalDemandFactorDefinition element.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace